Revit 2027 API
RebarContainerItem.ClearPresentationMode Method
 Sets the presentation mode for this rebar set to the default (either for a single view, or for all views).
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearPresentationMode(
	View dBView
)
Public Sub ClearPresentationMode (
	dBView As View
)
public:
void ClearPresentationMode(
	View^ dBView
)
member ClearPresentationMode :
        dBView : View -> unit
Parameters
dBView View
 The view where the presentation mode will be cleared. NULL for all views
Exceptions
Exception | Condition
InapplicableDataException |  This rebar element represents a single bar (the layout rule is Single).
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace